Revit 2026 API

# ViewHideActiveWorkPlane Method

---

Hide the active work plane of the view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void HideActiveWorkPlane()
```
```vb
Public Sub HideActiveWorkPlane
```
```cpp
public:
void HideActiveWorkPlane()
```
```fsharp
member HideActiveWorkPlane : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when there is no active sketch plane, or when an error occurs during setting the sketch plane visibility. |

#### Reference

View Class

Autodesk.Revit.DB Namespace